// циклы for и while
// while







// Синтаксис
// while (Условие) {
    // Тело цикла
    // Тут будет выполнятся код
// }
// Пример
let num = 0
while (num < 5) {
    console.log(num)
    num++
}
//-------------------------------
// Пример без {}
let num2 = 5
while (num2) console.log(num2--)
//-------------------------------------
// Конструкция DO ... WHILE
let num3 = 0
do {
    console.log(num3)
    num3++
} while (num3 < 5)
//----------------------------------------
//for синтаксис
// for (начало; условие; шаг;) {
//     // Тело цикла
//     // Тут будет выполнятся код
// }
//------------------------------------
// пример for
for (let num4 = 0; num4 < 5; num4++) {
    console.log(num4)
}
/*
1) выполняется начало - let num4 = 0
2) выполняется условие - num4 < 5
3) если условие true выполняется тело цикла - console.log(num4)
4) выполняется шаг - num4++
повтор начиная с пункта №2
*/

let num5             // создали переменную за пределами цикла, чтобы работать с переменной за пределами цикла
for (num5 = 0; num5 < 5; num5++) {
    console.log(num5)
}
console.log(`Вывод вне цикла ${num5}`)
//---------------------------------------------------
// можно убрать любую часть цикла
let num6 = 0
for (; num6 <5; num6++) {
    console.log(num6)
}
//-----------------------------------------------
// Деректива breakА
let num7 = 0
for (; num7 < 5; num7++) {
    console.log(num7)
    if (num7 === 2) break
}
console.log(`Работа окончена, num7 = ${num7}`)
//------------------------------------------------------
// Директива continue

let num8
for (num8 = 0; num8 < 5; num8++) {
    if (num8 === 2) continue                 // пропускает ===2
    console.log(num8)
}
// ----------------------------------------------------------
// break и continue не используется с ?. будет ошибка
// let num9
// for (num9 = 0; num9 < 5; num9++) {
//     (num != 2) ? console.log(num9) : continue                // ОШИБКА // нельзя ? и continue.
// }
//---------------------------------------------------------------
// Метки
firstFor: for (let num10 = 0; num10 < 2; num10++) {
    for (let size = 0; size < 3; size++) {
        if (size === 2) {
            break firstFor                      // тормозим родительский цикл с помошью break
        }
        console.log(size)
    }
}
//-------------------------
firstFor: for (let num11 = 0; num11 < 2; num11++) {
    for (let size2 = 0; size2 < 3; size2++) {
        if (size2 === 2) {
            continue firstFor                      // тормозим родительский цикл с помошью break
        }
        console.log(size2)
    }
}
// Домашнее задание
// Задача 1. Вывести в консоль числа от 1 до 5 всеми циклами
let six = 1
while (six < 6) {
    console.log(six)
    six++
}
//-------------------------------
let six2 = 1
do {
    console.log(six2)
    six2++
} while (six2 < 6)
//------------------------------
let six3
for (six3 = 1; six3 < 6; six3++) {
    console.log(six3)
}
//=============================================
// задача 2.
let six4 = 1
while (six4) {
    // последний результат 0, верно?             // нет, последний рез 1. 0 это fasle? он не запустит цикл
    console.log(six4)
    six4--
}
//===========================================
// Задача 3  перезаписать на while
for (let six5 = 0; six5 < 3; six5++) {
    console.log(`Число: ${six5}`)
}
//-----------------------------------------
let six7 = 0
while (six7 < 3) {
    console.log(`Число: ${six7}`)
    six7++
}
//-----------------------------------------
let six6 = 0
do {
    console.log(`Число: ${six6}`)
    six6++
} while (six6 < 3)
//=============================================
// Задача 4 Прекратить работу цикла 1 когда size равна 1
// Цикл 1
firstСircle: for (let six8 = 0; six8 < 12; six8++) {
    //Цикл 2
    for (let size8 = 0; size8 < 3; size8++) {
        console.log(size8)
        if (size8 === 1)
            break firstСircle
    }
}

































